print(40 + 3.14)                #перетворення цілого числа в число з плаваючою крапкою і вивід результата число з полаваючою крапкою
print(int(3.1415))              #скорочення числа з плаваючою крапкою в ціле число
print(float(3))                 #перетворення цілого числа в число з плаваючою крапкою

a = 3                           #ім'я створюється: не оголошується завчасно
b = 4

print(a + 1,',', a - 1)         #додавання та віднімання
print(b * 3,',', b / 2)         #множення та ділення
print(a % 2,',', b ** 2)        #ділення по модулю(знаходження залишка від ділення та число b в степені 2
print(2 + 4.0,',', 2.0 ** b)    #перетворення різнородних типів

print(b / 2 + a)
print(b / (2.0 + a))            #python автоматично групує компоненти згідно правилу старшинства